Config/ExchangePlans/ОбменВДБГУ2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ОбменВДБГУ2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьСуммыВыбытияМЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьПовторнуюЗагрузкуОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦМОСлужебные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦМО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

Config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госуслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>Горюче-смазочные материалы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолоднякИЖивотныеНаОткорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МягкийИнвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Посуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПитания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стройматериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыФормированияОперацийУчетаВещевогоДовольствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыФормированияОперацийУчетаВещевогоДовольствия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОднаОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоследовательностьОпераций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНеПереносится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходитВПоследовательность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ЦМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЦМО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ОперацииУчетаВещевогоДовольствия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОперацииУчетаВещевогоДовольствия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВещевогоДовольствия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормированияОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФормированияОперацийУчетаВещевогоДовольствия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УстанавливатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УстанавливатьЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставПоследовательностиОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОперацияУчетаВещевогоДовольствия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОперацииУчетаВещевогоДовольствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/ExchangePlans/ОбменВДБГУ2/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт

	Настройки.ИмяКонфигурацииИсточника = "БухгалтерияГосударственногоУчреждения";
	Настройки.ИмяКонфигурацииПриемника.Вставить("ВещевоеДовольствие");
	
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Истина; 
	
	Настройки.Алгоритмы.ПриПолученииВариантовНастроекОбмена   = Истина;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	
КонецПроцедуры

// Заполняет коллекцию вариантов настроек, предусмотренных для плана обмена.
// 
// Параметры:
//  ВариантыНастроекОбмена - ТаблицаЗначений - коллекция вариантов настроек обмена, см. описание возвращаемого значения
//                                       функции НастройкиПланаОбменаПоУмолчанию общего модуля ОбменДаннымиСервер.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияВариантовНастроек,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииВариантовНастроекОбмена(ВариантыНастроекОбмена, ПараметрыКонтекста) Экспорт

	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	ВариантНастройки.ИдентификаторНастройки = "";
	ВариантНастройки.КорреспондентВМоделиСервиса = Истина;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;

КонецПроцедуры

Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	ОписаниеВарианта.КраткаяИнформацияПоОбмену   = НСтр("ru = 'Обмен с ""1С: Вещевое довольствие"", редакция 2.0'");
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.ОбменВДБГУ2.Форма.ПодробнаяИнформация";
	
	ОписаниеВарианта.ИмяКонфигурацииКорреспондента          = "ВещевоеДовольствие";	
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru = '1С:Вещевое довольствие 8'");
	
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = НСтр("ru = 'Настройки обмена БГУ, ред. 2 - ВД, ред. 2'");
	
	ОписаниеВарианта.ПутьКФайлуКомплектаПравилНаПользовательскомСайте = "https://releases.1c.ru/project/UniformAllowances20";
	ОписаниеВарианта.ПутьКФайлуКомплектаПравилВКаталогеШаблонов = "1c\UniformAllowances\";
	
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = НСтр("ru = 'Обмен с ""1С: Вещевое довольствие"", редакция 2.0'");
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена               = НСтр("ru = 'Обмен с ""1С: Вещевое довольствие"", редакция 2.0 (настройка)'");
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена                       = НСтр("ru = 'Обмен с ""1С: Вещевое довольствие"", редакция 2.0'");
	
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ИспользуемыеТранспортыСообщенийОбмена();
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	
	ОписаниеВарианта.ОбщиеДанныеУзлов = "Организации";
	
КонецПроцедуры

Функция ТекстОписанияОграниченийПередачиДанных(ПараметрОрганизации) Экспорт

	Если ПараметрОрганизации.Количество() = 0 Тогда
		
		Возврат НСтр("ru = 'Не выбраны организации, участвующие в обмене.'");
		
	Иначе
		
		Возврат СтрШаблон(НСтр("ru = 'Только по выбранным организациям:
			|%1.'"), СтрСоединить(ПараметрОрганизации, ";" + Символы.ПС));
		
	КонецЕсли;

КонецФункции

#Область Обработчики

Процедура РегистрацияИзмененийНачальнойВыгрузкиДанных(Знач Получатель, СтандартнаяОбработка, Отбор) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИспользуемыеОрганизации = Новый Массив;
	ОрганизцииОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель, "Организации, ЦМОСлужебные");
	Выборка = ОрганизцииОбмена.Организации.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИспользуемыеОрганизации.Добавить(Выборка.Организация);
	КонецЦикла;
	ЦМОСлужебные = Новый ТаблицаЗначений;
	ЦМОСлужебные.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ЦМОСлужебные.Колонки.Добавить("ЦМО", Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	Выборка = ОрганизцииОбмена.ЦМОСлужебные.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЦМОСлужебные.Добавить(), Выборка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МягкийИнвентарь)
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подразделения.Ссылка
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.Владелец В(&Организации)
	|	И Подразделения.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ЭтоГруппа = ЛОЖЬ
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
	|	И Сотрудники.Владелец В(&Организации)
	|	И НЕ ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА КАК Поле1
	|				ИЗ
	|					Справочник.ЦМО КАК ЦМО
	|				ГДЕ
	|					ЦМО.Ссылка В (&ЦМОСлужебные)
	|					И ЦМО.Сотрудник = Сотрудники.Ссылка
	|					И ЦМО.Владелец В (&Организации))";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦМО.Ссылка
	|ИЗ
	|	Справочник.ЦМО КАК ЦМО
	|ГДЕ
	|	ЦМО.ПометкаУдаления = ЛОЖЬ
	|	И ЦМО.Владелец В(&Организации)
	|	И НЕ ЦМО.Ссылка В (&ЦМОСлужебные)
	|	И ЦМО.ЭтоГруппа = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МестаХранения.Ссылка
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Владелец В(&Организации)
	|	И МестаХранения.ЭтоГруппа = ЛОЖЬ
	|	И МестаХранения.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОперацииУчетаВещевогоДовольствия.Ссылка
	|ИЗ
	|	Справочник.ОперацииУчетаВещевогоДовольствия КАК ОперацииУчетаВещевогоДовольствия
	|ГДЕ
	|	ОперацииУчетаВещевогоДовольствия.Организация В(&Организации)
	|	И ОперацииУчетаВещевогоДовольствия.ПометкаУдаления = ЛОЖЬ
	|	И ОперацииУчетаВещевогоДовольствия.СпособФормированияОперации В (ЗНАЧЕНИЕ(Перечисление.СпособыФормированияОперацийУчетаВещевогоДовольствия.ОднаОперация), ЗНАЧЕНИЕ(Перечисление.СпособыФормированияОперацийУчетаВещевогоДовольствия.ПоследовательностьОпераций), ЗНАЧЕНИЕ(Перечисление.СпособыФормированияОперацийУчетаВещевогоДовольствия.ОперацияНеПереносится))";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиАналитикиВещевогоДовольствия.Ссылка
	|ИЗ
	|	Справочник.СтатьиАналитикиВещевогоДовольствия КАК СтатьиАналитикиВещевогоДовольствия
	|ГДЕ
	|	СтатьиАналитикиВещевогоДовольствия.ПометкаУдаления = ЛОЖЬ
	|	И СтатьиАналитикиВещевогоДовольствия.Организация В(&Организации)";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПостоянноДействующиеКомиссии.Ссылка
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК ПостоянноДействующиеКомиссии
	|ГДЕ
	|	ПостоянноДействующиеКомиссии.Владелец В(&Организации)
	|	И ПостоянноДействующиеКомиссии.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст +
	ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.ЭлементГруппа = ЛОЖЬ
	|	И ЕПСБУ.Код В (&КодыСчетов)";
	
	КодыСчетов = Новый Массив;
	КодыСчетов.Добавить("105.25");
	КодыСчетов.Добавить("105.26");
	КодыСчетов.Добавить("105.35");
	КодыСчетов.Добавить("105.36");
	КодыСчетов.Добавить("105.45");
	КодыСчетов.Добавить("105.46");
	КодыСчетов.Добавить("109.60");
	КодыСчетов.Добавить("109.70");
	КодыСчетов.Добавить("109.80");
	КодыСчетов.Добавить("401.10");
	КодыСчетов.Добавить("401.20");
	КодыСчетов.Добавить("304.04");
	Запрос.УстановитьПараметр("КодыСчетов", КодыСчетов);
	Запрос.УстановитьПараметр("Организации", ИспользуемыеОрганизации);
	Запрос.УстановитьПараметр("ЦМОСлужебные", ЦМОСлужебные.ВыгрузитьКолонку("ЦМО"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗарегистрированныеСсылки = Новый Массив;
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[0].Выбрать()); // номенклатура
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[1].Выбрать()); // подразделения
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[2].Выбрать()); // сотрудники
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[3].Выбрать()); // ЦМО
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[4].Выбрать()); // Места хранения
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[5].Выбрать()); // ОперацииУчетаВещевогоДовольствия
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[6].Выбрать()); // СтатьиАналитикиВещевогоДовольствия
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[7].Выбрать()); // Комиссии
	ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, РезультатЗапроса[8].Выбрать()); // ЕПСБУ
	
КонецПроцедуры

// Возвращает имя обработки выгрузки в составе конфигурации
//
Функция ИмяОбработкиВыгрузки() Экспорт
	
	Возврат "ОбработчикиВыгрузкиВВД2";
	
КонецФункции

// Возвращает имя обработки загрузки в составе конфигурации
//
Функция ИмяОбработкиЗагрузки() Экспорт
	
	Возврат "ОбработчикиЗагрузкиИзВД2";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает массив используемых транспортов сообщений для этого плана обмена
//
// Возвращаемое значение:
//  Массив из ОбработкаМенеджер
//
Функция ИспользуемыеТранспортыСообщенийОбмена()
	
	Результат = Новый Массив;
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаCOM);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаFILE);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаFTP);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаEMAIL);
	Результат.Добавить(Обработки.ТранспортСообщенийОбменаWS);
	
	Возврат Результат;
 	
КонецФункции

Процедура ЗарегистрироватьИзмененияИзРезультатаЗапроса(Получатель, Выборка, ЗарегистрированныеСсылки = Неопределено, ВключаяРодителя = Ложь)

	Пока Выборка.Следующий() Цикл
	
		ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Выборка.Ссылка);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
